[
    {
      "name": "Section 1",
      "image": "1.png",
      "description": "This period laid the foundation for my web development journey,building essential skills in front-end development and introducing me to the power of frameworks like Bootstrap.",
      "points": "<li><strong>Introduction to Web Technologies:</strong> Got inspired by a senior friend's freelancing work and started learning HTML, CSS, and JavaScript basics from W3Schools and CodeAcademy.</li>\n        <li><strong>Skills Acquired:</strong> HTML, CSS, JavaScript fundamentals.</li>\n        <li><strong>Introduced to Bootstrap:</strong> Explored Bootstrap for streamlining web development.</li>\n        <li><strong>Academic Focus:</strong> Temporarily prioritized academics while maintaining an interest in web technologies.</li>",
      "year": [
        2014,
        2015
      ]
    },
    {
      "name": "Section 2",
      "image": "2.png",
      "description": "The period from 2016 to 2017 was a thrilling and transformative time in my life. My foray into digital art, guided by online tutorials and supported by friends, opened doors to new opportunities as a Graphic Designer. This exposure empowered me to expand my creative capabilities, which would prove beneficial in my future endeavors, even in the realm of web development.",
      "points": "<li><strong>Exploring Digital Art:</strong> Ventured into digital art, learning Adobe Illustrator and After Effects through YouTube tutorials. Showcased my works in a <a class=\"underline\" href=\"https://hvkalayil.github.io/firstportfolio.github.io\" target=\"_blank\">portfolio.</a></li>\n        <li><strong>Graphic Design Internships:</strong> Participated in logo making contests, leading to <a class=\"underline\" target=\"_blank\" href=\"assets/cert/foodcubo.pdf\">internships</a> as a Graphic Designer.</li>\n        <li><strong>Encouragement:</strong> Support from friends circle motivated artistic growth.</li>\n        <li><strong>Added Skills:</strong> Acquired graphic design skills enhanced my capabilities as a one-man team, aiding personal projects later on.</li>",
      "year": [
        2016,
        2017
      ]
    },
    {
      "name": "Section 3",
      "image": "3.png",
      "description": "In 2018, I transitioned from 2D to 3D art, mastering Blender through tutorials. While working on an animated short, hardware limitations affected my motivation. Amidst academics, I led a team project, learning SQL and worked on a e-commerce website, reigniting my passion for coding. Guided by attentive professors, I honed documentation skills and delved into database design, marking my early steps into web development.",
      "points": "<li><strong>Venturing into 3D Art:</strong> Shifted focus from 2D to 3D art, learning Blender through tutorials and creating 3D renders.</li>\n        <li><strong>Animated Short Film:</strong> Worked on an <a target=\"_blank\" class=\"underline\" href=\"assets/cert/blender.png\">animated short</a> film but faced hardware limitations.</li>\n        <li><strong>Academics and Group Project:</strong> Focused on academics and led a team for a group project, gaining SQL and teamwork experience.</li>\n        <li><strong>Solo Web Development Project:</strong> Developed a simple e-commerce website using PHP, JavaScript, and MySQL, reigniting my passion for web development.</li>\n        <li><strong>Beyond Coding:</strong> Emphasized <a target=\"_blank\" class=\"underline\" href=\"assets/cert/marker.pdf\">documentation,</a> data flow diagrams, and database design in projects, broadening my knowledge.</li>",
      "year": [
        2018,
        2019
      ]
    },
    {
      "name": "Section 4",
      "image": "4.png",
      "description": "During this period, I deepened my focus on mobile application development with Flutter, leading to the successful publication of multiple apps on the Play Store. Through internships, I gained valuable experience collaborating with backend and design teams, developing a medical app and implementing WebRTC features. Additionally, I explored Python, creating a web app for the Combustion Research Lab. Academically, I led teams in developing a mobile e-commerce app and a college website, showcasing proficiency in Flutter and Django REST framework. This busy and transformative time laid a solid foundation for my career in web and mobile app development.",
      "points": "<li><strong>Mobile Application Development with Flutter:</strong> Published multiple apps on the Play Store, leading to internships and exposure to backend and design teams.</li>\n        <li><strong>Saudha Internship:</strong> Developed a medical details app with PHP backend and landing page website.</li>\n        <li><strong>Applore Internship:</strong> Gained insights into WebRTC technology and integrated backend and UI for projects.</li>\n        <li><strong>Python Web Application:</strong> Built a Flask-based app for the Combustion Research Lab, showcasing Python's versatility.</li>\n        <li><strong>Academic Projects:</strong> Led teams to create a pet fish e-commerce app (Flutter + Django REST) and a college website (PHP) with WYSIWYG editor and localization.</li>\n        ",
      "year": [
        2020,
        2021
      ]
    },
    {
      "name": "Section 5",
      "image": "5.png",
      "description": "During this period, I excelled in web application development, contributing significantly to a project for Viatris Pharma, learning Angular, Python, SQL, and CI/CD pipelines. Leading a team for country-specific requirements, I gained insights into Node and React. Transitioning to Biogen Pharma, I focused on tech setups and AWS architecture. Currently, I'm deepening my knowledge of cloud services and microservices. Additionally, I reignited my passion for game development, learning Godot.",
      "points": "<li><strong>Web Application Development for Viatris Pharma:</strong> Mastered Angular, Python, SQL, and CI/CD pipelines for a web app project. Led a team for country-specific requirements and explored Node and React.</li>\n        <li><strong>Transition to Biogen Pharma:</strong> Focused on tech setups and AWS architecture for a new project.</li>\n        <li><strong>Continuous Learning and Cloud Skillboost:</strong> Expanding knowledge in cloud services, microservices, Dockerization, Kubernetes, and pub-sub concepts. Pursuing Google Cloud Developer certification through Cloud Skillboost.</li>\n        <li><strong>Game Development with Godot:</strong> Reignited interest in game development, learning Godot through YouTube tutorials.</li>",
      "year": [
        2022,
        2023
      ]
    }
  ]